# Personal
brew "anomalyco/tap/opencode" # AI agent TUI
brew "asciinema"
brew "bash" # bourne again shell
brew "bat" # A cat(1) clone with syntax highlighting and Git integration.
brew "biome" # JS linter & formatter
brew "btop" # System resource monitor
brew "dprint" # Auto-formats source code based on the specified plugins.
brew "dyff" # Dif tool for yaml and sometimes json
brew "eza" # better ls
brew "fnm" # Node.js manager written in Rust
brew "gitui" # TUI for git
brew "glow" # TUI markdown viewer
brew "gnupg" # https://www.gnupg.org/
brew "helix" # Post-modern text editor for the terminal
brew "jj" # version control system
brew "jjui" # TUI for jj
brew "llvm" # Compiler infrastructure - for debugging Rust
brew "marksman" # LSP for markdown
brew "ripgrep" # grep but better and written in Rust
brew "starship" # Lightweight multiplatform terminal prompt
brew "stow" # a symlink farm manager
brew "superhtml" # HTML LSP
brew "uv" # python version & package manager
brew "witr" # Why is this running?
brew "xan" # CSV file viewer & processor
cask "affine" # mind mapping & note taking tool
cask "beekeeper-studio" # DB IDE
cask "bluesnooze" # Disable bluetooth when Mac sleeps
cask "espanso" # text replacer
cask "flameshot" # screenshot tool
cask "font-fira-code-nerd-font" # font for coding w/ ligatures
cask "ghostty" # Terminal
cask "legcord" # OpenSource Discord Client 
cask "maccy" # clipboard manager
cask "obs" # video recording & live streaming
cask "rectangle" # window manger for mac
cask "slack" # instant messaging
cask "zed" # IDE

# for yazi
brew "fd" # for file searching
brew "ffmpeg" # for video thumbnails
brew "fzf" # for quick file subtree navigation, >= 0.53.0
brew "imagemagick" # for Font, HEIC, and JPEG XL preview
brew "poppler" # for PDF preview
brew "resvg" # for SVG preview
brew "ripgrep" # for file content searching
brew "sevenzip" # for archive extraction and preview
brew "zoxide" # for historical directories navigation, requires fzf
cask "font-symbols-only-nerd-font" # for cool symbols
brew "yazi" # TUI file browser

# fzf tab completion
brew "gawk"
brew "grep"
brew "gnu-sed"
brew "coreutils"

# Derapi
brew "awscli"
brew "gh"
brew "mise"
brew "restish"
cask "notion"

