# Personal
brew "bat"
brew "dprint"
brew "eza"
brew "fnm"
brew "gitui"
brew "glow"
brew "gnupg"
brew "helix"
brew "marksman"
brew "stow"
cask "flameshot"
cask "font-fira-code-nerd-font"
cask "maccy"

# for yazi
brew "fd" # for file searching
brew "ffmpeg" # for video thumbnails
brew "fzf" # for quick file subtree navigation, >= 0.53.0
brew "imagemagick" # for Font, HEIC, and JPEG XL preview
brew "poppler" # for PDF preview
brew "resvg" # for SVG preview
brew "ripgrep" # for file content searching
brew "sevenzip" # for archive extraction and preview
brew "zoxide" # for historical directories navigation, requires fzf
cask "font-symbols-only-nerd-font" # for cool symbols
brew "yazi"

# Junction
brew "fnm"
brew "postgresql@17", restart_service: :changed, link: true
brew "protobuf"
brew "sqlfluff"
brew "sqlx-cli"
cask "orbstack"
