# Personal
brew "bat" # A cat(1) clone with syntax highlighting and Git integration.
brew "dprint" # Auto-formats source code based on the specified plugins.
brew "biome" # JS linter & formatter
brew "eza" # better ls
brew "fnm" # Node.js manager written in Rust
brew "gitui" # TUI for git
brew "glow" # TUI markdown viewer
brew "gnupg" # https://www.gnupg.org/
brew "helix" # Post-modern text editor for the terminal
brew "llvm" # Compiler infrastructure - for debugging Rust
brew "marksman" # LSP for markdown
brew "stow" # a symlink farm manager 
cask "bluesnooze" # Disable bluetooth when Mac sleeps
cask "flameshot" # screenshot tool
cask "font-fira-code-nerd-font" # font for coding w/ ligatures
cask "legcord" # OpenSource Discord Client 
cask "maccy" # clipboard manager

# for yazi
brew "fd" # for file searching
brew "ffmpeg" # for video thumbnails
brew "fzf" # for quick file subtree navigation, >= 0.53.0
brew "imagemagick" # for Font, HEIC, and JPEG XL preview
brew "poppler" # for PDF preview
brew "resvg" # for SVG preview
brew "ripgrep" # for file content searching
brew "sevenzip" # for archive extraction and preview
brew "zoxide" # for historical directories navigation, requires fzf
cask "font-symbols-only-nerd-font" # for cool symbols
brew "yazi" # TUI file browser

# Junction
brew "awscli"
brew "buf"
brew "fnm"
brew "grpcurl"
brew "k3d"
brew "postgresql@17", restart_service: :changed, link: true
brew "protobuf"
brew "sqlfluff"
brew "sqlx-cli"
cask "orbstack"
